// @strict-types

#Область ПрограммныйИнтерфейс

// См. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую
// 
// Параметры:
//  ШаблонТекстаЗапроса - см. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую.ШаблонТекстаЗапроса
//  База - см. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую.База
// 
// Возвращаемое значение:
//  см. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую
//
Функция ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую(Знач ШаблонТекстаЗапроса, Знач База = Неопределено) Экспорт
	
	Возврат Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую(ШаблонТекстаЗапроса, , База);
	
КонецФункции

// См. Спец_РаботаСБазойДанныхНапрямую.СформироватьТекстЗапросаДляУдаленияОбъектовИзБД
// 
// Параметры:
//  ИмяОбъектаМетаданных - Строка
//  МассивОтборов - см. Спец_РаботаСБазойДанныхНапрямую.СформироватьТекстЗапросаДляУдаленияОбъектовИзБД.МассивОтборов
// 
// Возвращаемое значение:
//  см. Спец_РаботаСБазойДанныхНапрямую.СформироватьТекстЗапросаДляУдаленияОбъектовИзБД
//
Функция СформироватьТекстЗапросаДляУдаленияОбъектовИзБД(Знач ИмяОбъектаМетаданных, Знач МассивОтборов) Экспорт
	
	Возврат Спец_РаботаСБазойДанныхНапрямую.СформироватьТекстЗапросаДляУдаленияОбъектовИзБД(ИмяОбъектаМетаданных, МассивОтборов);
	
КонецФункции

#КонецОбласти
