
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Спец_РаботаСБазойДанныхНапрямуюВызовСервераПовтИсп.ЗаписьНапрямуюДоступна() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.UnixTimestamp = Спец_ОбщегоНазначенияКлиентСервер.UnixTimestamp();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе

	ВызватьИсключение "Недопустимый вызов объекта на клиенте."

#КонецЕсли
