// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Спец_ОбменСДругимиБазами_Отправитель.ОбновитьПараметрыОбменов();
	#Иначе
		ОбновитьПараметрыОбменовВызовСервера();
	#КонецЕсли
	// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
	
КонецПроцедуры

#КонецОбласти

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПараметрыОбменовВызовСервера()
	
	Спец_ОбменСДругимиБазами_Отправитель.ОбновитьПараметрыОбменов();
	
КонецПроцедуры

#КонецОбласти
// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
