
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Если размер строки больше гига, сокращаем
	ОграничениеДлиныСтроки = 1024 * 1024 * 1024 - 1;
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если СтрДлина(Запись.ТекстОшибки) >= ОграничениеДлиныСтроки Тогда
			Запись.ТекстОшибки = Лев(Запись.ТекстОшибки, ОграничениеДлиныСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе

	ВызватьИсключение "Недопустимый вызов объекта на клиенте."

#КонецЕсли
