// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта
// 
// Параметры:
//  ИсходныйОбъект - см. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта.ИсходныйОбъект
//  Смещение - см. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта.Смещение
// 
// Возвращаемое значение:
//  см. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта
//
Функция СформироватьТекстовоеПредставлениеОбъекта(Знач ИсходныйОбъект, Знач Смещение = "") Экспорт
	
	Возврат Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта(ИсходныйОбъект, Смещение);
	
КонецФункции

// См. Спец_СтроковыеФункцииКлиентСервер.СтрокаСоответствуетРегулярномуВыражению
// 
// Параметры:
//  СтрокаДляПроверки - см. Спец_СтроковыеФункцииКлиентСервер.СтрокаСоответствуетРегулярномуВыражению.СтрокаДляПроверки
//  РегулярноеВыражение - см. Спец_СтроковыеФункцииКлиентСервер.СтрокаСоответствуетРегулярномуВыражению.РегулярноеВыражение
// 
// Возвращаемое значение:
//  см. Спец_СтроковыеФункцииКлиентСервер.СтрокаСоответствуетРегулярномуВыражению
//
Функция СтрокаСоответствуетРегулярномуВыражению(Знач СтрокаДляПроверки, Знач РегулярноеВыражение) Экспорт
	
	Возврат Спец_СтроковыеФункцииКлиентСервер.СтрокаСоответствуетРегулярномуВыражению(СтрокаДляПроверки, РегулярноеВыражение);
	
КонецФункции

#КонецОбласти
