// @strict-types

//@skip-check common-module-type

#Область СлужебныйПрограммныйИнтерфейс

// Подключает компоненту BaseFunction.
// 
// Параметры:
//  КонстантноеИмяКомпоненты - Булево - Подключать компоненту с константным именем
// 
// Возвращаемое значение:
//  Неопределено, ОбъектВнешнейКомпоненты - Компонента BaseFunction. Содержит следующие свойства:
// * ТекстПоследнейОшибки - Строка - Текст ошибок при выполнении последнего действия
// * ВерсияПриложения - Строка - Версия 1С приложения
// * ТипПриложения - Строка - Тип приложения, которое подключило данную компоненту
// * ПодключениеИзолированно - Булево - Флаг того, что компонента подключена изолированно
// * РазмерОчередиСобытий - Число - Количество событий в очереди для внешних событий
//
Функция ПолучитьКомпонентуBaseFunction(Знач КонстантноеИмяКомпоненты = Истина) Экспорт
	
	Попытка
		
		Возврат Спец_ОбщегоНазначенияКлиентСервер.ПодключитьВнешнююКомпонентуДляРаботы("ОбщийМакет.Спец_КомпонентаLykovExtFunctions",
				"l_BaseFunction",
				"BaseFunction",
				КонстантноеИмяКомпоненты,
				Истина);
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Подключает компоненту HTTPClient.
// 
// Параметры:
//  КонстантноеИмяКомпоненты - Булево - Подключать компоненту с константным именем
// 
// Возвращаемое значение:
//  Неопределено, ОбъектВнешнейКомпоненты - Компонента BaseFunction. Содержит следующие свойства (описаны только базовые):
// * ТекстПоследнейОшибки - Строка - Текст ошибок при выполнении последнего действия
// * ВерсияПриложения - Строка - Версия 1С приложения
// * ТипПриложения - Строка - Тип приложения, которое подключило данную компоненту
// * ПодключениеИзолированно - Булево - Флаг того, что компонента подключена изолированно
// * РазмерОчередиСобытий - Число - Количество событий в очереди для внешних событий
// * МаксимальноеКоличествоСоединенийВКэше - Число - https://curl.se/libcurl/c/CURLMOPT_MAXCONNECTS.html
// * МаксимальноеКоличествоПотоковДляHTTP2 - Число - https://curl.se/libcurl/c/CURLMOPT_MAX_CONCURRENT_STREAMS.html
// * МаксимальноеКоличествоСоединенийКОдномуХосту - Число - https://curl.se/libcurl/c/CURLMOPT_MAX_HOST_CONNECTIONS.html
// * МаксимальноеОбщееКоличествоСоединений - Число - https://curl.se/libcurl/c/CURLMOPT_MAX_TOTAL_CONNECTIONS.html
// * РежимОтладки - Булево - Флаг того, что нужно возвращать отладочную информацию по запросам.
// * ВозвращатьЗаголовки - Булево - Флаг того, что нужно возвращать заголовки по запросам.
// * ИспользоватьCookie - Булево - Флаг того, что нужно использовать Cookie в запросах.
// * ТаймаутМультиДескриптора - Число - https://curl.se/libcurl/c/curl_multi_wait.html
// * Username - Строка - https://curl.se/libcurl/c/CURLOPT_USERNAME.html
// * Password - Строка - https://curl.se/libcurl/c/CURLOPT_PASSWORD.html
// * Timeout_ms - Число - https://curl.se/libcurl/c/CURLOPT_TIMEOUT_MS.html
//
Функция ПолучитьКомпонентуHTTPClient(Знач КонстантноеИмяКомпоненты = Истина) Экспорт
	
	Попытка
		
		Возврат Спец_ОбщегоНазначенияКлиентСервер.ПодключитьВнешнююКомпонентуДляРаботы("ОбщийМакет.Спец_КомпонентаLykovHTTPClient",
				"l_HTTPClient",
				"HttpClient",
				КонстантноеИмяКомпоненты,
				Истина);
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Подключает компоненту PostgreSQL.
// 
// Параметры:
//  КонстантноеИмяКомпоненты - Булево - Подключать компоненту с константным именем
// 
// Возвращаемое значение:
//  Неопределено, ОбъектВнешнейКомпоненты - Компонента PostgreSQL. Содержит следующие свойства:
// * ТекстПоследнейОшибки - Строка - Текст ошибок при выполнении последнего действия
// * ВерсияПриложения - Строка - Версия 1С приложения
// * ТипПриложения - Строка - Тип приложения, которое подключило данную компоненту
// * ПодключениеИзолированно - Булево - Флаг того, что компонента подключена изолированно
// * РазмерОчередиСобытий - Число - Количество событий в очереди для внешних событий
// * СоединениеУстановлено - Булево - Флаг того, что данная компонента подключена к БД
// * Хост - Строка - Имя хоста подключённой БД
// * НаименованиеБазы - Строка - Наименование базы подключённой БД
// * ИмяПользователя - Строка - Имя пользователя, от которого подключена БД
// * Порт - Число - Порт подключения БД
// * ИДПроцесса - Число - ИД процесса сервера БД
// * Сокет - Строка - Socket подключения к БД
// * ВерсияПротокола - Строка - Версия протокола подключения к БД
// * ВерсияСервера - Строка - Версия сервера БД
// * Кодировка - Строка - Кодировка подключения к БД
//
Функция ПолучитьКомпонентуPostgreSQL(Знач КонстантноеИмяКомпоненты = Истина) Экспорт
	
	Попытка
		
		Возврат Спец_ОбщегоНазначенияКлиентСервер.ПодключитьВнешнююКомпонентуДляРаботы("ОбщийМакет.Спец_КомпонентаLykovPostgreSQL",
				"l_PostgreSQL",
				"PostgreSQL",
				КонстантноеИмяКомпоненты,
				Истина);
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Подключает компоненту MySQL.
// 
// Параметры:
//  КонстантноеИмяКомпоненты - Булево - Подключать компоненту с константным именем
// 
// Возвращаемое значение:
//  Неопределено, ОбъектВнешнейКомпоненты - Компонента MySQL. Содержит следующие свойства:
// * ТекстПоследнейОшибки - Строка - Текст ошибок при выполнении последнего действия
// * ВерсияПриложения - Строка - Версия 1С приложения
// * ТипПриложения - Строка - Тип приложения, которое подключило данную компоненту
// * ПодключениеИзолированно - Булево - Флаг того, что компонента подключена изолированно
// * РазмерОчередиСобытий - Число - Количество событий в очереди для внешних событий
// * ИнформацияОСоединении - Строка - Информация по текущему подключению к БД
//
Функция ПолучитьКомпонентуMySQL(Знач КонстантноеИмяКомпоненты = Истина) Экспорт
	
	Попытка
		
		Возврат Спец_ОбщегоНазначенияКлиентСервер.ПодключитьВнешнююКомпонентуДляРаботы("ОбщийМакет.Спец_КомпонентаLykovMySQL",
				"l_MySQLConn",
				"MySQLConn",
				КонстантноеИмяКомпоненты,
				Истина);
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Массив имён моих компонент.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из Строка - Массив имён моих компонент
//
Функция ПолучитьМассивИменМоихКомпонент() Экспорт
	
	МассивРезультат = Новый Массив(4);
	
	МассивРезультат[0] = "ОбщийМакет.Спец_КомпонентаLykovExtFunctions";
	МассивРезультат[1] = "ОбщийМакет.Спец_КомпонентаLykovHTTPClient";
	МассивРезультат[2] = "ОбщийМакет.Спец_КомпонентаLykovMySQL";
	МассивРезультат[3] = "ОбщийМакет.Спец_КомпонентаLykovPostgreSQL";
	
	Возврат Новый ФиксированныйМассив(МассивРезультат);
	
КонецФункции

#КонецОбласти
