
// @strict-types

#Область ПрограммныйИнтерфейс

// Тип маркировки по GTIN.
// 
// Параметры:
//  GTIN - ОпределяемыйТип.Спец_GTIN - GTIN позиции (14 символов)
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.Спец_ТипыМаркируемогоТовара
//
Функция ТипМаркировкиПоGTIN(Знач GTIN) Экспорт
	
	НаборЗаписей = РегистрыСведений.Спец_РеестрGTIN.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.GTIN.Установить(GTIN);
	
	НаборЗаписей.Прочитать();
	Возврат ?(НаборЗаписей.Количество() = 0,
			Перечисления.Спец_ТипыМаркируемогоТовара.ПустаяСсылка(),
			НаборЗаписей.Получить(0).ТипМаркировки);
	
КонецФункции

#КонецОбласти
