
// @strict-types

#Область ОбработчикиСобытий

// Параметры:
//  ПараметрКоманды - СправочникСсылка.Спец_ВнешниеОбработки
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ВызватьИсключение "Не указан элемент для получения данных из обработки!";
	КонецЕсли;
	
	Если Спец_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ЭтоГруппа") = Истина Тогда
		ВызватьИсключение "Это группа, тут нечего открывать!";
	КонецЕсли;
	
	Спец_ОбщегоНазначенияКлиент.ОткрытьВнешнююОбработку(ПараметрКоманды,
			, , ,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
