// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  ТипБазыДанных - Неопределено, ПеречислениеСсылка.Спец_ТипыБазыДанных -
// 
// Возвращаемое значение:
//  Булево
//
Функция ЗаписьНапрямуюДоступна(Знач ТипБазыДанных = Неопределено) Экспорт
	
	Если ТипБазыДанных = Неопределено Тогда
		ТипБазыДанных = Спец_ОбщегоНазначенияПовтИсп.СтруктураПараметровБазы().ТипБазыДанных;
	КонецЕсли;
	
	Если ТипБазыДанных = Перечисления.Спец_ТипыБазыДанных.PostgreSQL Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
