// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  ТипБазыДанных - Неопределено, ПеречислениеСсылка.Спец_ТипыБазыДанных -
// 
// Возвращаемое значение:
//  Булево
//
Функция ЗаписьНапрямуюДоступна(Знач ТипБазыДанных = Неопределено) Экспорт
	
	Если ТипБазыДанных = Неопределено Тогда
		
		ТипБазыДанных = Спец_ОбщегоНазначенияПовтИсп.СтруктураПараметровБазы().ТипБазыДанных;
		Если ТипБазыДанных <> Перечисления.Спец_ТипыБазыДанных.PostgreSQL Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.Спец_СтруктураТаблицБазыДанных КАК Спец_СтруктураТаблицБазыДанных
		|ГДЕ
		|	НЕ Спец_СтруктураТаблицБазыДанных.ПометкаУдаления";
		
		Возврат Не Запрос.Выполнить().Пустой();
		
	Иначе
		
		Возврат ТипБазыДанных = Перечисления.Спец_ТипыБазыДанных.PostgreSQL;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
