// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С
// 
// Параметры:
//  Источник - см. Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С.Источник
//  УровеньЛога - см. Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С.УровеньЛога
//  ТекстДляЗаписи - см. Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С.ТекстДляЗаписи
//  UnixTimestamp - см. Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С.UnixTimestamp
//  ДвоичныеДанныеФайла - см. Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С.ДвоичныеДанныеФайла
//
Процедура ЗаписатьГотовыйЛогВРегистрЧерез1С(Знач Источник, Знач УровеньЛога, Знач ТекстДляЗаписи, Знач UnixTimestamp, Знач ДвоичныеДанныеФайла) Экспорт

	Спец_ЛогированиеОбъектов.ЗаписатьГотовыйЛогВРегистрЧерез1С(Источник, УровеньЛога, ТекстДляЗаписи, UnixTimestamp, ДвоичныеДанныеФайла);

КонецПроцедуры

// Возвращаемое значение:
//	см. Спец_ЛогированиеОбъектов.ПолучитьСоответствиеУровнейЛогирования
//
Функция ПолучитьСоответствиеУровнейЛогирования() Экспорт
	
	Возврат Спец_ЛогированиеОбъектов.ПолучитьСоответствиеУровнейЛогирования();
	
КонецФункции

#КонецОбласти
