// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Справочник.Спец_МассивЗначенийКонстант КАК Спец_МассивЗначенийКонстант
	|ГДЕ
	|	Спец_МассивЗначенийКонстант.Владелец = &Владелец
	|	И Спец_МассивЗначенийКонстант.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Спец_ОбщегоНазначения.СообщитьПользователю("По данной константе ПВХ уже есть массовое значение!", , "Объект.Владелец", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
