
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитыСсылки = Спец_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные.Ссылка, "НаименованиеВ1С, Наименование");
	Представление   = ?(Не ПустаяСтрока(РеквизитыСсылки.НаименованиеВ1С),
			СтрШаблон("%1 - %2", РеквизитыСсылки.Наименование, РеквизитыСсылки.НаименованиеВ1С),
			РеквизитыСсылки.Наименование);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
