
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Спец_РаботаСФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Объект.ИмяКомпьютера = Спец_ОбщегоНазначенияКлиентСервер.ПолучитьИмяКомпьютера(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СписокУстройств = Спец_МенеджерОборудованияВызовСервера.МассивСтруктурОборудованияПоПараметрам( , , ТекущийОбъект.Ссылка);
	Для Каждого СтруктураУстройства Из СписокУстройств Цикл
		
		ЛокальноеОборудование.Добавить(СтруктураУстройства.ИдентификаторУстройства,
				СтруктураУстройства.Наименование,
				Ложь,
				ПолучитьКартинкуДляОборудования(СтруктураУстройства.ИмяТипаОборудования));
		
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Спец_РаботаСФормамиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СтрШаблон("%1 (%2)", Объект.ИмяКомпьютера, Спец_ОбщегоНазначенияКлиентСервер.ТекущийПользовательСистемы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Спец_РаботаСФормамиКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

// ++ Спец_БСП.Спец_ЛогированиеОбъектов
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ОткрытьЛогиПоОбъекту(Команда)
	
	Спец_ЛогированиеОбъектовКлиент.ОткрытьЛогиПоОбъекту(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
// -- Спец_БСП.Спец_ЛогированиеОбъектов

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКартинкуДляОборудования(Знач ИмяТипаОборудования)
	
	Возврат ?(Не ПустаяСтрока(ИмяТипаОборудования),
			БиблиотекаКартинок["Спец_ПодключаемоеОборудование" + ИмяТипаОборудования],
			Неопределено);
	
КонецФункции

#КонецОбласти
