// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

//@skip-check statement-type-change
//@skip-check invocation-parameter-type-intersect
//@skip-check property-return-type
#Область КрасиваяПанельОтборов

// Параметры:
//  Форма - см. Спец_РаботаСФормами.ПриСозданииНаСервере.Форма
//  ИмяЭлемента - Строка
//  ИспользоватьОтбор - Булево
//
Процедура УстановитьНовоеЗначениеОтбора(Знач Форма, Знач ИмяЭлемента, Знач ИспользоватьОтбор = Истина) Экспорт
	
	СтруктураИнформацииПоОтборам = Спец_ОбщегоНазначенияКлиентСервер.ПолучитьСоответствиеJSON(Форма[ИмяРеквизитаДляИнформацииПоОтборам()], , Ложь);
	Если СтруктураИнформацииПоОтборам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИнформацияПоРеквизиту = Спец_РаботаСКоллекциямиКлиентСервер.НайтиСтрокиВКоллекцииСтрок(Новый Структура("ИмяЭлемента", ИмяЭлемента),
			СтруктураИнформацииПоОтборам.МассивОтборов,
			Истина);
	
	Если СтруктураИнформацияПоРеквизиту = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Форма[ИмяЭлемента]) = Тип("СтандартныйПериод") Тогда
		
		ГруппаОтборПоПериоду = Спец_ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				Форма[СтруктураИнформацииПоОтборам.ПутьКДаннымСписка].КомпоновщикНастроек.Настройки.Отбор,
				ИмяЭлемента + "_ГруппаИ",
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		Спец_ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				ГруппаОтборПоПериоду,
				СтруктураИнформацияПоРеквизиту.ИмяПоля,
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
				Форма[ИмяЭлемента].ДатаНачала,
				ИмяЭлемента + "ДатаНачала",
				ЗначениеЗаполнено(Форма[ИмяЭлемента].ДатаНачала),
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		Спец_ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				ГруппаОтборПоПериоду,
				СтруктураИнформацияПоРеквизиту.ИмяПоля,
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
				Форма[ИмяЭлемента].ДатаОкончания,
				ИмяЭлемента + "ДатаОкончания",
				ИспользоватьОтбор И ЗначениеЗаполнено(Форма[ИмяЭлемента].ДатаОкончания),
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		УстановитьЗаголовокПериода(Форма, ИмяЭлемента);
		
	Иначе
		
		Спец_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма[СтруктураИнформацииПоОтборам.ПутьКДаннымСписка],
				СтруктураИнформацияПоРеквизиту.ИмяПоля,
				Форма[ИмяЭлемента],
				Спец_ОбщегоНазначенияКлиентСервер.ПолучитьXMLЗначениеПоНормальному(Тип("ВидСравненияКомпоновкиДанных"), СтруктураИнформацияПоРеквизиту.ВидСравнения),
				,
				ИспользоватьОтбор И ЗначениеЗаполнено(Форма[ИмяЭлемента]),
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Форма - см. Спец_РаботаСФормами.ПриСозданииНаСервере.Форма
//  ИмяЭлемента - Строка
//
Процедура УстановитьЗаголовокПериода(Знач Форма, Знач ИмяЭлемента) Экспорт
	
	СтруктураИнформацииПоОтборам = Спец_ОбщегоНазначенияКлиентСервер.ПолучитьСоответствиеJSON(Форма[ИмяРеквизитаДляИнформацииПоОтборам()], , Ложь);
	Если СтруктураИнформацииПоОтборам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИнформацияПоРеквизиту = Спец_РаботаСКоллекциямиКлиентСервер.НайтиСтрокиВКоллекцииСтрок(Новый Структура("ИмяЭлемента", ИмяЭлемента),
			СтруктураИнформацииПоОтборам.МассивОтборов,
			Истина);
	
	Если СтруктураИнформацияПоРеквизиту = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивФорматированнаяСтрока = Новый Массив(); // Массив из Строка
	
	МассивФорматированнаяСтрока.Добавить(СтруктураИнформацияПоРеквизиту.Заголовок);
	МассивФорматированнаяСтрока.Добавить(": ");
	
	//@skip-check new-font
	ШрифтКурсив = Новый Шрифт(Форма.Элементы[ИмяЭлемента].Шрифт, , , , Истина);
	Если Форма[ИмяЭлемента].Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод
		Или Не ЗначениеЗаполнено(Форма[ИмяЭлемента].Вариант) Тогда
		
		Если Не ЗначениеЗаполнено(Форма[ИмяЭлемента].ДатаНачала) И Не ЗначениеЗаполнено(Форма[ИмяЭлемента].ДатаОкончания) Тогда
			
			МассивФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("за всё время", ШрифтКурсив));
			
		Иначе
			
			Если ЗначениеЗаполнено(Форма[ИмяЭлемента].ДатаНачала) Тогда
				МассивФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("с " + Формат(Форма[ИмяЭлемента].ДатаНачала, "ДЛФ=DT") + " ", ШрифтКурсив));
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма[ИмяЭлемента].ДатаОкончания) Тогда
				МассивФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("по " + Формат(Форма[ИмяЭлемента].ДатаОкончания, "ДЛФ=DT"), ШрифтКурсив));
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		МассивФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(Строка(Форма[ИмяЭлемента].Вариант), ШрифтКурсив));
		
	КонецЕсли;
	
	Форма.Элементы[ИмяЭлемента].Заголовок = Новый ФорматированнаяСтрока(МассивФорматированнаяСтрока);
	
КонецПроцедуры

// Параметры:
//  Форма - см. Спец_РаботаСФормами.ПриСозданииНаСервере.Форма
//
Процедура УстановитьВидимостьГруппыОтборов(Знач Форма) Экспорт
	
	Форма.Элементы[ИмяОсновнойГруппыПанелейОтборов()].Видимость              = Форма[ИмяРеквизитаРазделительНажат()];
	Форма.Элементы[ИмяДекорацииРазделителяГруппыОсновныхПанелей()].Заголовок = ?(Форма[ИмяРеквизитаРазделительНажат()], ">>", "<<");
	Форма.Элементы[ИмяДекорацииРазделителяГруппыОсновныхПанелей()].Рамка     = Новый Рамка(?(Форма[ИмяРеквизитаРазделительНажат()], ТипРамкиЭлементаУправления.Вдавленная, ТипРамкиЭлементаУправления.Выпуклая), 2);
	
КонецПроцедуры

// Возвращаемое значение:
//	Строка
//
Функция ИмяРеквизитаДляИнформацииПоОтборам() Экспорт
	
	Возврат "Спец_ИнформацияПроДобавленныеОтборы";
	
КонецФункции

// Возвращаемое значение:
//	Строка
//
Функция ИмяРеквизитаКрасивыеОтборыДобавлены() Экспорт
	
	Возврат "Спец_КрасиваяПанельДобавлена";
	
КонецФункции

// Возвращаемое значение:
//	Строка
//
Функция ИмяПроцедурыДляОбработкиСобытияОтбора() Экспорт
	
	Возврат "Подключаемый_ОбработкаСобытияОтбора";
	
КонецФункции

// Возвращаемое значение:
//	Строка
//
Функция ИмяРеквизитаРазделительНажат() Экспорт
	
	Возврат "Спец_РазделительНажат";
	
КонецФункции

// Возвращаемое значение:
//	Строка
//
Функция ИмяОсновнойГруппыПанелейОтборов() Экспорт
	
	Возврат "Спец_ГруппаПанельКрасивыхОтборов_Основная";
	
КонецФункции

// Возвращаемое значение:
//	Строка
//
Функция ИмяДекорацииРазделителяГруппыОсновныхПанелей() Экспорт
	
	Возврат "Спец_ГруппаПанельКрасивыхОтборов_Разделитель";
	
КонецФункции

// Возвращаемое значение:
//	Строка
//
Функция ИмяКлючаНастроекВХранилищеНастроек() Экспорт
	
	Возврат "Спец_ОтборыДляКрасивойПанели";
	
КонецФункции

#КонецОбласти

#КонецОбласти
