// @strict-types

#Область ПрограммныйИнтерфейс

// См. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую
// 
// Параметры:
//  ШаблонТекстаЗапроса - см. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую.ШаблонТекстаЗапроса
//  База - см. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую.База
// 
// Возвращаемое значение:
//  см. Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую
//
Функция ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую(Знач ШаблонТекстаЗапроса, Знач База = Неопределено) Экспорт
	
	Возврат Спец_РаботаСБазойДанныхНапрямую.ПодставитьНаименованияТаблицДляТекстаЗапросаНапрямую(ШаблонТекстаЗапроса, , База);
	
КонецФункции

#КонецОбласти
