// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
		Спец_ОбменСДругимиБазами_Отправитель.ОбновитьПараметрыОбменов();
		// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

	#Иначе
		
		ОбновитьПараметрыОбменовВызовСервера();
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПараметрыОбменовВызовСервера()
	
	// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
	Спец_ОбменСДругимиБазами_Отправитель.ОбновитьПараметрыОбменов();
	// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
	
КонецПроцедуры

#КонецОбласти
