
#Область ОписаниеПеременных

// ++ Подсистема "Спец_БСП" Лыков А.А.
Перем Спец_КэшКлиент Экспорт; // см. Спец_КлиентСерверГлобальный.Спец_ПолучитьКэш
// -- Лыков А.А.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// ++ Подсистема "Спец_БСП" Лыков А.А.
	Спец_ОбщегоНазначенияКлиент.ПередНачаломРаботыСистемы(Отказ);
	// -- Лыков А.А.
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// ++ Подсистема "Спец_БСП" Лыков А.А.
	Спец_ОбщегоНазначенияКлиент.ПриНачалеРаботыСистемы();
	// -- Лыков А.А.
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	
	// ++ Подсистема "Спец_БСП" Лыков А.А.
	Спец_ОбщегоНазначенияКлиент.ПриЗавершенииРаботыСистемы();
	// -- Лыков А.А.
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// ++ Подсистема "Спец_БСП" Лыков А.А.
	Если Спец_ОбщегоНазначенияКлиент.ОбработкаВнешнегоСобытияКомпоненты(Источник, Событие, Данные) Тогда
		Возврат;
	КонецЕсли;
	// -- Лыков А.А.
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

Спец_КэшКлиент = Спец_ОбщегоНазначенияКлиентСервер.БазовыйКэш();

#КонецОбласти
