// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления Тогда
		ВключитьОбмен = Ложь;
	КонецЕсли;
	
	// Чистим адреса FTP
	АдресFTPДляОбменов = СтрЗаменить(АдресFTPДляОбменов, "\", "/");
	Если СтрЗаканчиваетсяНа(АдресFTPДляОбменов, "/") Тогда
		АдресFTPДляОбменов = Лев(АдресFTPДляОбменов, СтрДлина(АдресFTPДляОбменов) - 1);
	КонецЕсли;

	ВнутреннийПутьКаталогаFTP = СтрЗаменить(ВнутреннийПутьКаталогаFTP, "\", "/");
	Если СтрНачинаетсяС(ВнутреннийПутьКаталогаFTP, "/") Тогда
		ВнутреннийПутьКаталогаFTP = Прав(ВнутреннийПутьКаталогаFTP, СтрДлина(ВнутреннийПутьКаталогаFTP) - 1);
	КонецЕсли;
	Если СтрЗаканчиваетсяНа(ВнутреннийПутьКаталогаFTP, "/") Тогда
		ВнутреннийПутьКаталогаFTP = Лев(ВнутреннийПутьКаталогаFTP, СтрДлина(ВнутреннийПутьКаталогаFTP) - 1);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

#Иначе

	ВызватьИсключение "Недопустимый вызов объекта на клиенте."

#КонецЕсли
