
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
// 
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "Драйвер1СЭквайринговыеТерминалыСбербанк";
//	Драйвер.Наименование = НСтр("ru = '1С:Эквайринговые терминалы Сбербанк'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "SberAcquiringTerminal"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
	Драйвер.ИмяДрайвера  = "Драйвер1СЭквайринговыеТерминалыСбербанк2х";
	Драйвер.Наименование = НСтр("ru = '1С:Эквайринговые терминалы Сбербанк 2.Х'", Метаданные.ОсновнойЯзык.КодЯзыка);
	Драйвер.ИдентификаторОбъекта = "SberAcquiringTerminal2"; 
	Драйвер.ВерсияДрайвера = "2.6.1.3";       
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверИНПАСЭквайринговыеТерминалыUNIPOS";
//	Драйвер.Наименование = НСтр("ru = 'ИНПАС:Эквайринговые терминалы UNIPOS'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "a_inpasDC1c83"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверTRPOSЭквайринговыеТерминалы";
//	Драйвер.Наименование = НСтр("ru = 'TRPOS:Эквайринговые терминалы'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "a_trpos1c82"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверUCSEFTPOSЭквайринговыеТерминалы";
//	Драйвер.Наименование = НСтр("ru = 'UCS-AT:Эквайринговые терминалы'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "UcsAT"; 
//	Драйвер.ВерсияДрайвера = "1.3.2"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверГАЗПРОМБАНКЭквайринговыеТерминалы";
//	Драйвер.Наименование = НСтр("ru = 'ГАЗПРОМБАНК:Эквайринговые терминалы'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "GPBEMVGateNativeAPI1C"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверARCUS2ЭквайринговыеТерминалыIngenico";
//	Драйвер.Наименование = НСтр("ru = 'ARCUS2:Эквайринговые терминалы Ingenico'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "IngenicoDriver1C";   
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверIngenicoЭквайринговыеТерминалыARCUS";
//	Драйвер.Наименование = НСтр("ru = 'Ingenico:Драйвер эквайринговой системы ARCUS 2.1'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "IngenicoDriver1C21";   
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверIboxProПоддержкаMPosЭквайринга";
//	Наименование = НСтр("ru = '%1:Поддержка %2 эквайринга'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.Наименование = СтрШаблон(Наименование, "iboxPro", "mPos");
//	Драйвер.ИдентификаторОбъекта = "iboxPro"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверШтрихМПлатежныйТерминалYarus";
//	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:Платежный терминал Yarus'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "ShtrihPayMan1C"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверMPos2canЭквайринг";
//	Наименование = НСтр("ru = '%1 2can:Поддержка 2can эквайринга'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.Наименование = СтрШаблон(Наименование, "mPos");
//	Драйвер.ИдентификаторОбъекта = "mPos2can"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверSKAM1CЭквайринговыеСистемы";
//	Драйвер.Наименование = НСтр("ru = 'SKAM-1C:Эквайринговые системы'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "skam"; 
//	Драйвер.ВерсияДрайвера = "1.0.7"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверSKAMUNIPOSЭквайринговыеСистемы";
//	Драйвер.Наименование = НСтр("ru = 'SKAM-UNIPOS:Эквайринговое решение Софт-Кейс'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "skam2"; 
//	Драйвер.ВерсияДрайвера = "1.0.7_ds"; 
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверИНПАСЭквайринговыеТерминалыНСПК";
//	Драйвер.Наименование = НСтр("ru = 'ИНПАС:Эквайринговые терминалы UNIPOS(ФЗ-491)'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "a_inpasdc1c83n";   
//	Драйвер.ВерсияДрайвера = "1.1.14.24";
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверПБФЭквайринговыеТерминалы";
//	Драйвер.Наименование = НСтр("ru = 'ПБФ:Драйвер терминала Aisino'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "TerminalAisino";    
	
//	Драйвер = ДрайвераОборудования.Добавить();
//	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал;
//	Драйвер.ИмяДрайвера  = "ДрайверSkyPOSЭквайринговыеТерминалы";
//	Драйвер.Наименование = НСтр("ru = 'Sky-POS:Эквайринговые терминалы'", Метаданные.ОсновнойЯзык.КодЯзыка);
//	Драйвер.ИдентификаторОбъекта = "CSkyposDriver";    
//	Драйвер.ВерсияДрайвера = "1.0.16";
	
КонецПроцедуры

#КонецОбласти