// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. Спец_PostgreSQL.ПолучитьСтруктуруТаблицыПоИмениМетаданных
// 
// Параметры:
//	НаименованиеВ1С - см. Спец_PostgreSQL.ПолучитьСтруктуруТаблицыПоИмениМетаданных.НаименованиеВ1С
//	НазначениеТаблицы - см. Спец_PostgreSQL.ПолучитьСтруктуруТаблицыПоИмениМетаданных.НазначениеТаблицы
// 
// Возвращаемое значение:
//	см. Спец_PostgreSQL.ПолучитьСтруктуруТаблицыПоИмениМетаданных
//
Функция ПолучитьСтруктуруТаблицыПоИмениМетаданных(Знач НаименованиеВ1С, Знач НазначениеТаблицы = "Основная") Экспорт

	//@skip-check constructor-function-return-section
	Возврат Спец_PostgreSQL.ПолучитьСтруктуруТаблицыПоИмениМетаданных(НаименованиеВ1С, НазначениеТаблицы);

КонецФункции

// Соответствие предопределённых данных и ГУИДов в PostgreSQL.
// 
// Возвращаемое значение:
//	ФиксированноеСоответствие из КлючИЗначение:
//		* Ключ - ЛюбаяСсылка - Ссылка на предопределённый объект
//		* Значение - Строка - ГУИД элемента в базе данных
//
Функция ПолучитьСоответствиеПредопределенныхДанныхИГУИДов() Экспорт

	СоответствиеРезультат = Новый Соответствие();

	ВыборкаРезультат = ПолучитьДанныеПоПредопределеннымОбъектамИИхГУИДами();
	Пока ВыборкаРезультат.Следующий() Цикл СоответствиеРезультат[ВыборкаРезультат.ПредопределенныйОбъект] = ВыборкаРезультат.ГУИДВБазеДанных; КонецЦикла;
	Возврат Новый ФиксированноеСоответствие(СоответствиеРезультат);

КонецФункции

// Имя столбца в PostgreSQL по имени колонки в 1С.
// 
// Параметры:
//	ИмяМетаданныхТаблицыВ1С - Строка - Имя метаданных таблицы в 1С
//	ИмяПоля - Строка - Имя поля в 1С
//	ТипСоставногоПоля - Неопределено, ПеречислениеСсылка.Спец_ТипыСоставныхПолейБазыДанных - Тип составного поля
// 
// Возвращаемое значение:
//  Строка - Имя столбца в PostgreSQL
//
Функция ПолучитьИмяПоляВPostgreSQLПоИмениВ1С(Знач ИмяМетаданныхТаблицыВ1С, Знач ИмяПоля, Знач ТипСоставногоПоля = Неопределено) Экспорт

	СтруктураТаблицы = Спец_PostgreSQLВызовСервераПовтИсп.ПолучитьСтруктуруТаблицыПоИмениМетаданных(ИмяМетаданныхТаблицыВ1С);
	Если ПустаяСтрока(СтруктураТаблицы.НаименованиеВPostgreSQL) Тогда
		Возврат "";
	КонецЕсли;

	ВРегИмяПоля = ВРег(ИмяПоля);
	Для Каждого КлючЗначение Из СтруктураТаблицы.Поля Цикл

		Если ВРег(КлючЗначение.Ключ) <> ВРегИмяПоля Тогда
			Продолжить;
		КонецЕсли;

		Если ТипСоставногоПоля = Неопределено Тогда

			МассивРезультат = Новый Массив(); // Массив из Строка
			Для Каждого СтруктураПоля Из КлючЗначение.Значение Цикл
				МассивРезультат.Добавить(СтруктураПоля.ИмяСтолбцаВPostgreSQL);
			КонецЦикла;

			Возврат СтрСоединить(МассивРезультат, ",");

		Иначе

			Если КлючЗначение.Значение.Количество() = 1 Тогда

				Для Каждого СтруктураПоля Из КлючЗначение.Значение Цикл
					Возврат СтруктураПоля.ИмяСтолбцаВPostgreSQL;
				КонецЦикла;

			КонецЕсли;

			Для Каждого СтруктураПоля Из КлючЗначение.Значение Цикл

				Если СтруктураПоля.ТипСоставногоПоля = ТипСоставногоПоля Тогда
					Возврат СтруктураПоля.ИмяСтолбцаВPostgreSQL;
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	Возврат "";

КонецФункции

// Получить ГУИД предопределенного элемента в PostgreSQL.
// 
// Параметры:
//	ПредопределенныйЭлемент - ЛюбаяСсылка - Предопределенный элемент, для которого нужно получить ГУИД в PostgreSQL
// 
// Возвращаемое значение:
//	Строка - ГУИД объекта
//
Функция ПолучитьГУИДПредопределенногоЭлементаВPostgreSQL(Знач ПредопределенныйЭлемент) Экспорт

	СоответствиеОбъектов = Спец_PostgreSQLВызовСервераПовтИсп.ПолучитьСоответствиеПредопределенныхДанныхИГУИДов();
	Возврат Спец_РаботаСКоллекциямиКлиентСервер.СвойствоСоответствия(СоответствиеОбъектов, ПредопределенныйЭлемент, "");

КонецФункции

// Получить предопределённый элемент по ГУИДу в базе.
// 
// Параметры:
//  ГУИДЭлемента - Строка - ГУИД элемента
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - Предопределённый объект по ГУИДу
//
Функция ПолучитьПредопределенныйЭлементПоГУИДуВБазе(Знач ГУИДЭлемента) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктураТаблицБазыДанныхПредопределенныеДанные.ЭлементСсылка КАК ЭлементСсылка
	|ИЗ
	|	Справочник.Спец_СтруктураТаблицБазыДанных КАК СтруктураТаблицБазыДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Спец_СтруктураТаблицБазыДанных.ПредопределенныеДанные КАК СтруктураТаблицБазыДанныхПредопределенныеДанные
	|		ПО СтруктураТаблицБазыДанных.Ссылка = СтруктураТаблицБазыДанныхПредопределенныеДанные.Ссылка
	|ГДЕ
	|	СтруктураТаблицБазыДанныхПредопределенныеДанные.ГУИДВБазеДанных = &ГУИДВБазеДанных
	|	И НЕ СтруктураТаблицБазыДанных.ПометкаУдаления";

	Запрос.УстановитьПараметр("ГУИДВБазеДанных", ГУИДЭлемента);

	Возврат Спец_ОбщегоНазначения.ПолучитьСтруктуруПервойВыборкиЗапроса(Запрос, "ЭлементСсылка");

КонецФункции

// Получить наименование таблицы в 1С по коду в БД.
// 
// Параметры:
//  КодТаблицы - Число - Код таблицы в БД
// 
// Возвращаемое значение:
//  Строка - Наименование таблицы
//
Функция ПолучитьНаименованиеТаблицыПоКоду(Знач КодТаблицы) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спец_СтруктураТаблицБазыДанных.НаименованиеВ1С КАК НаименованиеВ1С
	|ИЗ
	|	Справочник.Спец_СтруктураТаблицБазыДанных КАК Спец_СтруктураТаблицБазыДанных
	|ГДЕ
	|	Спец_СтруктураТаблицБазыДанных.Код = &Код
	|	И НЕ Спец_СтруктураТаблицБазыДанных.ПометкаУдаления";

	Запрос.УстановитьПараметр("Код", КодТаблицы);

	Возврат Спец_ОбщегоНазначения.ПолучитьСтруктуруПервойВыборкиЗапроса(Запрос, "НаименованиеВ1С");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//	ВыборкаИзРезультатаЗапроса:
//		* ПредопределенныйОбъект - ЛюбаяСсылка
//		* ГУИДВБазеДанных - Строка
//
Функция ПолучитьДанныеПоПредопределеннымОбъектамИИхГУИДами()

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураТаблицPostgreSQLПредопределенныеДанные.ЭлементСсылка КАК ПредопределенныйОбъект,
	|	СтруктураТаблицPostgreSQLПредопределенныеДанные.ГУИДВБазеДанных КАК ГУИДВБазеДанных
	|ИЗ
	|	Справочник.Спец_СтруктураТаблицБазыДанных КАК СтруктураТаблицБазыДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Спец_СтруктураТаблицБазыДанных.ПредопределенныеДанные КАК
	|			СтруктураТаблицPostgreSQLПредопределенныеДанные
	|		ПО СтруктураТаблицБазыДанных.Ссылка = СтруктураТаблицPostgreSQLПредопределенныеДанные.Ссылка
	|ГДЕ
	|	НЕ СтруктураТаблицБазыДанных.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

#КонецОбласти
