// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта
// 
// Параметры:
//  ИсходныйОбъект - см. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта.ИсходныйОбъект
//  Смещение - см. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта.Смещение
// 
// Возвращаемое значение:
//  см. Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта
//
Функция СформироватьТекстовоеПредставлениеОбъекта(Знач ИсходныйОбъект, Знач Смещение) Экспорт
	
	Возврат Спец_СтроковыеФункцииКлиентСервер.СформироватьТекстовоеПредставлениеОбъекта(ИсходныйОбъект, Смещение);
	
КонецФункции

// См. Спец_СтроковыеФункцииКлиентСервер.ЗакодироватьСтрокуВBase64
// 
// Параметры:
//  ИсходнаяСтрока - см. Спец_СтроковыеФункцииКлиентСервер.ЗакодироватьСтрокуВBase64.ИсходнаяСтрока
// 
// Возвращаемое значение:
//  см. Спец_СтроковыеФункцииКлиентСервер.ЗакодироватьСтрокуВBase64
//
Функция ЗакодироватьСтрокуВBase64(Знач ИсходнаяСтрока) Экспорт
	
	Возврат Спец_СтроковыеФункцииКлиентСервер.ЗакодироватьСтрокуВBase64(ИсходнаяСтрока);
	
КонецФункции

#КонецОбласти
