// @strict-types

#Область ПрограммныйИнтерфейс

// См. Спец_РаботаСФоновымиЗаданиями.ЗапуститьВыполнениеФоновогоЗадания
// 
// Параметры:
//  СтруктураПараметровВыполнения - см. Спец_РаботаСФоновымиЗаданиями.ЗапуститьВыполнениеФоновогоЗадания.СтруктураПараметровВыполнения
//  ВремяОжидания - Число - см. Спец_РаботаСФоновымиЗаданиями.ЗапуститьВыполнениеФоновогоЗадания.ВремяОжидания
//  ВремяОграничениеЕслиУжеЗапущено - Число - см. Спец_РаботаСФоновымиЗаданиями.ЗапуститьВыполнениеФоновогоЗадания.ВремяОграничениеЕслиУжеЗапущено
//
Процедура ЗапуститьВыполнениеФоновогоЗадания(СтруктураПараметровВыполнения, Знач ВремяОжидания = 3600, Знач ВремяОграничениеЕслиУжеЗапущено = 0) Экспорт
	
	Спец_РаботаСФоновымиЗаданиями.ЗапуститьВыполнениеФоновогоЗадания(СтруктураПараметровВыполнения, ВремяОжидания, ВремяОграничениеЕслиУжеЗапущено);
	
КонецПроцедуры

// См. Спец_РаботаСФоновымиЗаданиями.ПолучитьСтруктуруСостоянияФоновогоЗадания
// 
// Параметры:
//  СтруктураЗадания - см. Спец_РаботаСФоновымиЗаданиямиКлиентСервер.ПолучитьСтруктуруПараметровВыполненияФоновогоЗадания
// 
// Возвращаемое значение:
//  см. Спец_РаботаСФоновымиЗаданиями.ПолучитьСтруктуруСостоянияФоновогоЗадания
//
Функция ПолучитьСтруктуруСостоянияФоновогоЗадания(СтруктураЗадания) Экспорт
	
	Возврат Спец_РаботаСФоновымиЗаданиями.ПолучитьСтруктуруСостоянияФоновогоЗадания(СтруктураЗадания);
	
КонецФункции

// См. Спец_РаботаСФоновымиЗаданиями.РезультатВыполненияФоновогоЗадания
// 
// Параметры:
//  СтруктураЗадания - см. Спец_РаботаСФоновымиЗаданиямиКлиентСервер.ПолучитьСтруктуруПараметровВыполненияФоновогоЗадания
//  ПропуститьОжиданиеВыполнения - см. Спец_РаботаСФоновымиЗаданиями.РезультатВыполненияФоновогоЗадания.ПропуститьОжиданиеВыполнения
//
Процедура РезультатВыполненияФоновогоЗадания(СтруктураЗадания, Знач ПропуститьОжиданиеВыполнения = Ложь) Экспорт
	
	Спец_РаботаСФоновымиЗаданиями.РезультатВыполненияФоновогоЗадания(СтруктураЗадания, ПропуститьОжиданиеВыполнения);
	
КонецПроцедуры

#КонецОбласти
