
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьОбъекты_ПоОбъекту(Знач ЭтоБазаОтправитель, Знач База, Знач ОбъектДляРегистрации, Знач ПолноеИмяОбъектаМетаданных = "",
		Знач UnixTimestamp = 0, ТекстыОшибок = "") Экспорт
	
	Спец_ОбменСДругимиБазами.ЗарегистрироватьОбъекты_ПоОбъекту(ЭтоБазаОтправитель, База, ОбъектДляРегистрации, ПолноеИмяОбъектаМетаданных, UnixTimestamp, ТекстыОшибок);
	
КонецПроцедуры

Процедура ПонизитьПриоритет_ПоОбъекту(Знач ЭтоБазаОтправитель, Знач База, Знач ОбъектДляСнятияРегистрации, Знач UnixTimestamp = 0, ТекстыОшибок = "") Экспорт
	
	Спец_ОбменСДругимиБазами.ПонизитьПриоритет_ПоОбъекту(ЭтоБазаОтправитель, База, ОбъектДляСнятияРегистрации, UnixTimestamp, ТекстыОшибок);
	
КонецПроцедуры

Процедура СнятьСРегистрацииОбъекты_ПоОбъекту(Знач ЭтоБазаОтправитель, Знач База, Знач ОбъектДляСнятияРегистрации, Знач UnixTimestamp = 0, ТекстыОшибок = "") Экспорт
	
	Спец_ОбменСДругимиБазами.СнятьСРегистрацииОбъекты_ПоОбъекту(ЭтоБазаОтправитель, База, ОбъектДляСнятияРегистрации, UnixTimestamp, ТекстыОшибок);
	
КонецПроцедуры

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

Процедура ОбновитьОбщиеПараметрыОбменов(Знач БазаПолучатель, Знач ПроходитьПоОбъектам = Истина, ТекстыОшибок = "") Экспорт
	
	Спец_ОбменСДругимиБазами_Отправитель.ОбновитьОбщиеПараметрыОбменов(БазаПолучатель, ПроходитьПоОбъектам, ТекстыОшибок);
	
КонецПроцедуры

Процедура ОбновитьПараметрыОбменовПоОбъекту(Знач БазаПолучатель, Знач ПолноеИмяОбъектаМетаданныхОтправитель, ТекстыОшибок = "") Экспорт
	
	Спец_ОбменСДругимиБазами_Отправитель.ОбновитьПараметрыОбменовПоОбъекту(БазаПолучатель, ПолноеИмяОбъектаМетаданныхОтправитель, ТекстыОшибок);
	
КонецПроцедуры

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

Функция МассивПараметровДляПередачиВБазу(Знач База) Экспорт
	
	Возврат Спец_ОбменСДругимиБазами.МассивПараметровДляПередачиВБазу(База);
	
КонецФункции

#КонецОбласти
