
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Кэш = Спец_ПолучитьКэш();
	ТипБазы = Спец_ОбщегоНазначенияПовтИсп.СтруктураПараметровБазы().ТипБазыДанных;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураТаблицБазыДанных.Метаданные КАК Метаданные,
	|	СтруктураТаблицБазыДанных.НаименованиеВ1С КАК НаименованиеВ1С
	|ИЗ
	|	Справочник.Спец_СтруктураТаблицБазыДанных КАК СтруктураТаблицБазыДанных
	|ГДЕ
	|	СтруктураТаблицБазыДанных.Метаданные <> """"
	|	И СтруктураТаблицБазыДанных.НаименованиеВ1С <> """"";
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультат.Следующий() Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ВыборкаРезультат.Метаданные);
		Если МетаданныеОбъекта = Неопределено Или Спец_ОбщегоНазначения.ЭтоПеречисление(МетаданныеОбъекта, Кэш) Тогда
			Продолжить;
		КонецЕсли;
		
		РодительМетаданных = МетаданныеОбъекта.Родитель();
		Если СтрЗаканчиваетсяНа(ВыборкаРезультат.НаименованиеВ1С, ".Изменения") Тогда
			
			СтруктураПоМетаданным = Спец_ОбщегоНазначения.ПолучитьСтруктуруИмениТипаДанныхОбъекта(МетаданныеОбъекта, Кэш);
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(ВыборкаРезультат.НаименованиеВ1С, СтрШаблон("%1: %2 - %3",
				СтруктураПоМетаданным.ТипОбъектаЕдинственноеЧисло,
				МетаданныеОбъекта.Представление(),
				"Изменения планов обменов"));
			
		ИначеЕсли ТипЗнч(РодительМетаданных) = Тип("ОбъектМетаданныхКонфигурация") Тогда
			
			СтруктураПоМетаданным = Спец_ОбщегоНазначения.ПолучитьСтруктуруИмениТипаДанныхОбъекта(МетаданныеОбъекта, Кэш);
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(ВыборкаРезультат.НаименованиеВ1С, СтрШаблон("%1: %2",
					СтруктураПоМетаданным.ТипОбъектаЕдинственноеЧисло,
					МетаданныеОбъекта.Представление()));
			
		Иначе
			
			СтруктураПоМетаданным = Спец_ОбщегоНазначения.ПолучитьСтруктуруИмениТипаДанныхОбъекта(РодительМетаданных, Кэш);
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(ВыборкаРезультат.НаименованиеВ1С, СтрШаблон("%1: %2 - %3",
				СтруктураПоМетаданным.ТипОбъектаЕдинственноеЧисло,
				РодительМетаданных.Представление(),
				МетаданныеОбъекта.Представление()));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ИмяТаблицы.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяТаблицыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Спец_РаботаСФормамиКлиент.АвтоПодборТекстаИзСпискаВыбораСтрок(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОчистить(Команда)
	
	Если ПустаяСтрока(ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	Кэш = Спец_ПолучитьКэш();
	
	Спец_КомпонентаДополнительныеФункцииКлиентСервер.НачатьЗамер("ОчисткаТаблицы", Кэш);
	Если Не Спец_РаботаСБазойДанныхНапрямуюКлиентСервер.УдалитьДанныеПоОбъекту1СВБазеДанных(Новый Массив, ИмяТаблицы, , Кэш) Тогда
		ВызватьИсключение "Не удалось! Возможно, тип базы данных не поддерживается.";
	КонецЕсли;
	ВремяВыполнения = Строка(Спец_КомпонентаДополнительныеФункцииКлиентСервер.ЗавершитьЗамер("ОчисткаТаблицы", Кэш)) + " сек.";
	
КонецПроцедуры

#КонецОбласти
