// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// ++ Спец_БСП.ОбменСДругимиБазами_ЧтоТоЕсть
	Если Не Спец_ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("Спец_БСП.Спец_ОбменыСДругимиБазами.Спец_ОбменыСДругимиБазами_Отправитель") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбработки = "Обработка.Спец_ОбменСДругимиБазами.Форма.ФормаНастройкиОбменов";
	ОткрытьФорму(ИмяОбработки,
			Новый Структура("База", ПараметрКоманды),
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	// -- Спец_БСП.ОбменСДругимиБазами_ЧтоТоЕсть
	
КонецПроцедуры

#КонецОбласти
