// @strict-types

#Область ПрограммныйИнтерфейс

// См. Спец_МенеджерОборудования.МассивСтруктурОборудованияПоПараметрам
// 
// Параметры:
//  МассивТиповПО - см. Спец_МенеджерОборудования.МассивСтруктурОборудованияПоПараметрам.МассивТиповПО
//  ИдентификаторУстройства - см. Спец_МенеджерОборудования.МассивСтруктурОборудованияПоПараметрам.ИдентификаторУстройства
//  РабочееМесто - см. Спец_МенеджерОборудования.МассивСтруктурОборудованияПоПараметрам.РабочееМесто
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудования.МассивСтруктурОборудованияПоПараметрам
//
Функция МассивСтруктурОборудованияПоПараметрам(Знач МассивТиповПО = Неопределено, Знач ИдентификаторУстройства = Неопределено, Знач РабочееМесто = Неопределено) Экспорт
	
	Возврат Спец_МенеджерОборудования.МассивСтруктурОборудованияПоПараметрам(МассивТиповПО, ИдентификаторУстройства, РабочееМесто);
	
КонецФункции

// См. Спец_МенеджерОборудования.СтруктураПараметровОборудования
// 
// Параметры:
//  ИдентификаторУстройства - см. Спец_МенеджерОборудования.СтруктураПараметровОборудования.ИдентификаторУстройства
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудования.СтруктураПараметровОборудования
//
Функция СтруктураПараметровОборудования(Знач ИдентификаторУстройства) Экспорт
	
	//@skip-check constructor-function-return-section
	Возврат Спец_МенеджерОборудования.СтруктураПараметровОборудования(ИдентификаторУстройства);
	
КонецФункции

// См. Спец_МенеджерОборудования.СтруктураДанныхПоДрайверуОборудования
// 
// Параметры:
//  ДрайверОборудования - см. Спец_МенеджерОборудования.СтруктураДанныхПоДрайверуОборудования.ДрайверОборудования
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудования.СтруктураДанныхПоДрайверуОборудования
//
Функция СтруктураДанныхПоДрайверуОборудования(Знач ДрайверОборудования) Экспорт
	
	//@skip-check constructor-function-return-section
	Возврат Спец_МенеджерОборудования.СтруктураДанныхПоДрайверуОборудования(ДрайверОборудования);
	
КонецФункции

// См. Спец_МенеджерОборудования.РабочееМестоПоИдентификаторуКлиента
// 
// Параметры:
//  ИдентификаторКлиента - см. Спец_МенеджерОборудования.РабочееМестоПоИдентификаторуКлиента.ИдентификаторКлиента
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудования.РабочееМестоПоИдентификаторуКлиента
//
Функция РабочееМестоПоИдентификаторуКлиента(Знач ИдентификаторКлиента) Экспорт
	
	Возврат Спец_МенеджерОборудования.РабочееМестоПоИдентификаторуКлиента(ИдентификаторКлиента);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. Спец_МенеджерОборудования.ОбновитьПоставляемыеДрайвера
//
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	Спец_МенеджерОборудования.ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

// См. Спец_МенеджерОборудования.ДрайвераДляПереустановки
// 
// Параметры:
//  РабочееМесто - см. Спец_МенеджерОборудования.ДрайвераДляПереустановки.РабочееМесто
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудования.ДрайвераДляПереустановки
//
Функция ДрайвераДляПереустановки(Знач РабочееМесто) Экспорт
	
	Возврат Спец_МенеджерОборудования.ДрайвераДляПереустановки(РабочееМесто);
		
КонецФункции

// См. Спец_МенеджерОборудования.УстановитьПризнакПереустановки
// 
// Параметры:
//  ПодключаемоеОборудование - см. Спец_МенеджерОборудования.УстановитьПризнакПереустановки.ПодключаемоеОборудование
//  Признак - см. Спец_МенеджерОборудования.УстановитьПризнакПереустановки.Признак
//
Процедура УстановитьПризнакПереустановки(Знач ПодключаемоеОборудование, Знач Признак) Экспорт
	
	Спец_МенеджерОборудования.УстановитьПризнакПереустановки(ПодключаемоеОборудование, Признак);
	
КонецПроцедуры

// См. Спец_МенеджерОборудованияКлиентСервер.ПолучитьОписаниеДрайвераПоXML
// 
// Параметры:
//  Данные - см. Спец_МенеджерОборудованияКлиентСервер.ПолучитьОписаниеДрайвераПоXML.Данные
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудованияКлиентСервер.ПолучитьОписаниеДрайвераПоXML
//
Функция ПолучитьОписаниеДрайвераПоXML(Знач Данные) Экспорт
	
	Возврат Спец_МенеджерОборудованияКлиентСервер.ПолучитьОписаниеДрайвераПоXML(Данные);
	
КонецФункции

// См. Спец_МенеджерОборудованияКлиентСервер.ПрочитатьКорневойЭлементXML
// 
// Параметры:
//  Данные - см. Спец_МенеджерОборудованияКлиентСервер.ПрочитатьКорневойЭлементXML.Данные
// 
// Возвращаемое значение:
//  см. Спец_МенеджерОборудованияКлиентСервер.ПрочитатьКорневойЭлементXML
//
Функция ПрочитатьКорневойЭлементXML(Знач Данные) Экспорт
	
	Возврат Спец_МенеджерОборудованияКлиентСервер.ПрочитатьКорневойЭлементXML(Данные);
	
КонецФункции

#КонецОбласти
