
// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//@skip-check invocation-parameter-type-intersect
	ОткрытьФорму("Справочник.Спец_ПодключаемоеОборудование.Форма.ФормаНастройки",
			Новый Структура("ПодключаемоеОборудование", ПараметрКоманды),
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка,
			Новый ОписаниеОповещения("ПослеНастройкиПараметровПодключения", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Результат - Произвольный
//  ФормаРодитель - ФормаКлиентскогоПриложения, РасширениеФормыКлиентскогоПриложенияДляСправочника - 
&НаКлиенте
Процедура ПослеНастройкиПараметровПодключения(Знач Результат, Знач ФормаРодитель) Экспорт
	
	Если Спец_РаботаСКоллекциямиКлиентСервер.ЕстьРеквизитОбъекта(ФормаРодитель, "Объект") Тогда
		ФормаРодитель.Прочитать();
	КонецЕсли;
	
	ФормаРодитель.ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти
