// @strict-types

//@skip-check method-too-many-params
//@skip-check common-module-type

#Область СлужебныйПрограммныйИнтерфейс

// Коды GS1.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//		* Ключ - Строка - Код
//		* Значение - см. Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.НовоеОписаниеКода
//
Функция КодыGS1() Экспорт
	
	Коды = Новый Соответствие;
	
	ДобавитьКодGS1(Коды, "00"  , "SSCC"                      , 18);
	ДобавитьКодGS1(Коды, "01"  , "GTIN"                      , 14);
	ДобавитьКодGS1(Коды, "02"  , "CONTENT"                   , 14);
	ДобавитьКодGS1(Коды, "10"  , "BATCH_LOT"                 ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "11"  , "PROD_DATE"                 ,  6);
	ДобавитьКодGS1(Коды, "12"  , "DUE_DATE"                  ,  6);
	ДобавитьКодGS1(Коды, "13"  , "PACK_DATE"                 ,  6);
	ДобавитьКодGS1(Коды, "15"  , "BEST_BEFORE"               ,  6);
	ДобавитьКодGS1(Коды, "16"  , "SELL_BY"                   ,  6);
	ДобавитьКодGS1(Коды, "17"  , "EXPIRE"                    ,  6);
	ДобавитьКодGS1(Коды, "20"  , "VARIANT"                   ,  2);
	ДобавитьКодGS1(Коды, "21"  , "SERIAL"                    ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "22"  , "CPV"                       ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "240" , "ADDITIONAL_ID"             ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "241" , "CUSTOMER_PART_NO"          ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "242" , "MTO_VARIANT"               ,   ,  6);
	ДобавитьКодGS1(Коды, "243" , "PCN"                       ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "250" , "SECONDARY_SERIAL"          ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "251" , "REF_TO_SOURCE"             ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "253" , "GDTI"                      , 13, 17,  Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Число(), Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "254" , "GLN_EXTENSION_COMPONENT"   ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "255" , "GСТ"                       , 13, 12);
	ДобавитьКодGS1(Коды, "30"  , "VAR_COUNT"                 ,   , 8);
	ДобавитьКодGS1(Коды, "310n", "NET_WEIGHT_kg"             ,  6);
	ДобавитьКодGS1(Коды, "311n", "LENGTH_m"                  ,  6);
	ДобавитьКодGS1(Коды, "312n", "WIDTH_m"                   ,  6);
	ДобавитьКодGS1(Коды, "313n", "HEIGHT_m"                  ,  6);
	ДобавитьКодGS1(Коды, "314n", "AREA_m2"                   ,  6);
	ДобавитьКодGS1(Коды, "315n", "NET_VOLUME_l"              ,  6);
	ДобавитьКодGS1(Коды, "316n", "NET_VOLUME_m3"             ,  6);
	ДобавитьКодGS1(Коды, "320n", "NET_WEIGHT_lb"             ,  6);
	ДобавитьКодGS1(Коды, "321n", "LENGTH_i"                  ,  6);
	ДобавитьКодGS1(Коды, "322n", "LENGTH_f"                  ,  6);
	ДобавитьКодGS1(Коды, "323n", "LENGTH_y"                  ,  6);
	ДобавитьКодGS1(Коды, "324n", "WIDTH_i"                   ,  6);
	ДобавитьКодGS1(Коды, "325n", "WIDTH_f"                   ,  6);
	ДобавитьКодGS1(Коды, "326n", "WIDTH_y"                   ,  6);
	ДобавитьКодGS1(Коды, "327n", "HEIGHT_i"                  ,  6);
	ДобавитьКодGS1(Коды, "328n", "HEIGHT_f"                  ,  6);
	ДобавитьКодGS1(Коды, "329n", "HEIGHT_y"                  ,  6);
	ДобавитьКодGS1(Коды, "330n", "GROSS_WEIGHT_kg"           ,  6);
	ДобавитьКодGS1(Коды, "331n", "LENGTH_m_log"              ,  6);
	ДобавитьКодGS1(Коды, "332n", "WIDTH_m_log"               ,  6);
	ДобавитьКодGS1(Коды, "333n", "HEIGHT_m_log"              ,  6);
	ДобавитьКодGS1(Коды, "334n", "AREA_m2_log"               ,  6);
	ДобавитьКодGS1(Коды, "335n", "VOLUME_l_log"              ,  6);
	ДобавитьКодGS1(Коды, "336n", "VOLUME_m3_log"             ,  6);
	ДобавитьКодGS1(Коды, "337n", "KG_PER_m2"                 ,  6);
	ДобавитьКодGS1(Коды, "340n", "GROSS_WEIGHT_lb"           ,  6);
	ДобавитьКодGS1(Коды, "341n", "LENGTH_i_log"              ,  6);
	ДобавитьКодGS1(Коды, "342n", "LENGTH_f_log"              ,  6);
	ДобавитьКодGS1(Коды, "343n", "LENGTH_y_log"              ,  6);
	ДобавитьКодGS1(Коды, "344n", "WIDTH_i_log"               ,  6);
	ДобавитьКодGS1(Коды, "345n", "WIDTH_f_log"               ,  6);
	ДобавитьКодGS1(Коды, "346n", "WIDTH_y_log"               ,  6);
	ДобавитьКодGS1(Коды, "347n", "HEIGHT_i_log"              ,  6);
	ДобавитьКодGS1(Коды, "348n", "HEIGHT_f_log"              ,  6);
	ДобавитьКодGS1(Коды, "349n", "HEIGHT_y_log"              ,  6);
	ДобавитьКодGS1(Коды, "350n", "AREA_i2"                   ,  6);
	ДобавитьКодGS1(Коды, "351n", "AREA_f2"                   ,  6);
	ДобавитьКодGS1(Коды, "352n", "AREA_y2"                   ,  6);
	ДобавитьКодGS1(Коды, "353n", "AREA_i2_log"               ,  6);
	ДобавитьКодGS1(Коды, "354n", "AREA_f2_log"               ,  6);
	ДобавитьКодGS1(Коды, "355n", "AREA_y2_log"               ,  6);
	ДобавитьКодGS1(Коды, "356n", "NET_WEIGHT_t"              ,  6);
	ДобавитьКодGS1(Коды, "357n", "NET_VOLUME_oz"             ,  6);
	ДобавитьКодGS1(Коды, "360n", "NET_VOLUME_q"              ,  6);
	ДобавитьКодGS1(Коды, "361n", "NET_VOLUME_g"              ,  6);
	ДобавитьКодGS1(Коды, "362n", "VOLUME_q"                  ,  6);
	ДобавитьКодGS1(Коды, "363n", "VOLUME_g"                  ,  6);
	ДобавитьКодGS1(Коды, "364n", "VOLUME_i3"                 ,  6);
	ДобавитьКодGS1(Коды, "365n", "VOLUME_f3"                 ,  6);
	ДобавитьКодGS1(Коды, "366n", "VOLUME_y3"                 ,  6);
	ДобавитьКодGS1(Коды, "367n", "VOLUME_i3_log"             ,  6);
	ДобавитьКодGS1(Коды, "368n", "VOLUME_f3_log"             ,  6);
	ДобавитьКодGS1(Коды, "369n", "VOLUME_y3_log"             ,  6);
	ДобавитьКодGS1(Коды, "37"  , "COUNT"                     ,   ,  8);
	ДобавитьКодGS1(Коды, "390n", "AMOUNT"                    ,   , 15);
	ДобавитьКодGS1(Коды, "391n", "AMOUNT_ISO"                ,  3, 15);
	ДобавитьКодGS1(Коды, "392n", "PRICE"                     ,   , 15);
	ДобавитьКодGS1(Коды, "393n", "PRICE_ISO"                 ,  3, 15);
	ДобавитьКодGS1(Коды, "394n", "PRCNT_OFF"                 ,  4,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "400" , "ORDER_NUMBER"              ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "401" , "GINC"                      ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "402" , "GSIN"                      , 17,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "403" , "ROUTE"                     ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "410" , "SHIP_TO_LOC"               , 13);
	ДобавитьКодGS1(Коды, "411" , "BILL_TO"                   , 13);
	ДобавитьКодGS1(Коды, "412" , "PURCHASE_FROM"             , 13);
	ДобавитьКодGS1(Коды, "413" , "SHIP_FOR_LOC"              , 13);
	ДобавитьКодGS1(Коды, "414" , "LOC_No"                    , 13);
	ДобавитьКодGS1(Коды, "415" , "PAY_TO"                    , 13);
	ДобавитьКодGS1(Коды, "416" , "PROD_SERV_LOC"             , 13);
	ДобавитьКодGS1(Коды, "420" , "SHIP_TO_POST"              ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "421" , "SHIP_TO_POST_ISO"          ,  3,  9,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "422" , "ORIGIN"                    ,  3,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "423" , "CONTRY_INITIAL_PROCESS"    ,  3, 12);
	ДобавитьКодGS1(Коды, "424" , "CONTRY_PROCESS"            ,  3,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "425" , "CONTRY_DISASSEMBLY"        ,  3, 12);
	ДобавитьКодGS1(Коды, "426" , "CONTRY_FULL_PROCESS"       ,  3,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "427" , "ORIGIN_SUBDIVISION"        ,   ,  3,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7001", "NSN"                       , 13,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "7002", "MEAT_CUT"                  ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7003", "EXPIRY_TIME"               , 10,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "7004", "ACTIVE_POTENCY"            ,   ,  4);
	ДобавитьКодGS1(Коды, "7005", "CATCH_AREA"                ,   , 12,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7006", "FIRST_FREEZE_DATE"         ,  6,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "7007", "HARVEST_DATE"              ,  6,  6);
	ДобавитьКодGS1(Коды, "7008", "AQUATIC_SPECIES"           ,   ,  3,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7009", "FISHING_GEAR_TYPE"         ,   , 10,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7010", "PROD_METHOD"               ,   ,  2,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7020", "REFURB_LOT"                ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7021", "FUNC_STAT"                 ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7022", "REV_STAT"                  ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "7023", "GIAI_ASSEMBLY"             ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "703s", "PROCESSOR_s"               ,  3, 27,  Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Число(), Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "710" , "NHRN_PZN"                  ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "711" , "NHRN_CIP"                  ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "712" , "NHRN_CN"                   ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "713" , "NHRN_DRN"                  ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8001", "DIMENSIONS"                , 14,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "8002", "CMT_No"                    ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8003", "GRAI"                      , 14, 16,  Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Число(), Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8004", "GIAI"                      ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8005", "PRICE_PER_UNIT"            ,  6,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "8006", "ITIP_or_GCTIN"             , 18,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "8007", "IBAN"                      ,   , 34,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8008", "PROD_TIME"                 ,  8, 4,               ,                , Истина);
	ДобавитьКодGS1(Коды, "8010", "CPID"                      ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8011", "CPID_SERIAL"               ,   , 12);
	ДобавитьКодGS1(Коды, "8012", "VERSION"                   ,   , 20,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8017", "GSRN_PROVIDER"             , 18,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "8018", "GSRN_RECIPIENT"            , 18,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "8019", "SRIN"                      ,   , 10);
	ДобавитьКодGS1(Коды, "8020", "REF_No"                    ,   , 25,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8110", "COUPON_CODE_ID"            ,   , 70,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8111", "POINTS"                    ,  4,   ,               ,               , Истина);
	ДобавитьКодGS1(Коды, "8112", "PAPPERLESS_COUPON_CODE_ID" ,   , 70,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "8200", "PRODUCT_URL"               ,   , 70,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "90"  , "INTERNAL"                  ,   , 30,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "91"  , "INTERNAL1"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "92"  , "INTERNAL2"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "93"  , "INTERNAL3"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "94"  , "INTERNAL4"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "95"  , "INTERNAL5"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "96"  , "INTERNAL6"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "97"  , "INTERNAL7"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "98"  , "INTERNAL8"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	ДобавитьКодGS1(Коды, "99"  , "INTERNAL9"                 ,   , 90,               , Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.ТипGS1Строка());
	
	Возврат Спец_РаботаСКоллекциямиКлиентСервер.СкопироватьСоответствие(Коды, Истина);
	
КонецФункции

// Подключает внешнюю компоненту для генерации штрих-кодов
// 
// Возвращаемое значение:
//	ОбъектВнешнейКомпоненты - Компонента для генерации штрих-кодов:
//		* ECL - Число
//		* GS1DatabarКоличествоСтрок - Число
//		* АвтоТип - Булево
//		* Версия - Строка
//		* ВертикальноеВыравниваниеКода - Число
//		* ВертСмещение - Число
//		* ВидимостьКС - Булево
//		* ВыравниваниеКода - Число
//		* Высота - Число
//		* ГорСмещение - Число
//		* ГрафикаУстановлена - Булево
//		* ЗначениеКода - Строка
//		* ИмяФайла - Строка
//		* КоличествоСтолбцов - Число
//		* КоличествоСтрок - Число
//		* КоличествоШрифтов - Число
//		* КонтрольныйСимвол - Строка
//		* ЛоготипКартинка - Строка - Картинка в формате Base64 
//		* ЛоготипРазмерПроцентОтШК - Число
//		* МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения - Число
//		* МинимальнаяВысотаКода - Число
//		* МинимальнаяШиринаКода - Число
//		* ОриентацияТекста - Число
//		* ОтображатьТекст - Булево
//		* ПоложениеТекста - Число
//		* ПрозрачныйФон - Булево
//		* Пропорции - Строка
//		* РазделителиКода - Число
//		* РазмерКрая - Число
//		* РазмерШрифта - Число
//		* Результат - Число
//		* СодержитКС - Булево
//		* ТекстКода - Строка
//		* ТипВходныхДанных - Число
//		* ТипКода - Число
//		* УбратьЛишнийФон - Булево
//		* УголПоворота - Число
//		* УровеньКоррекцииQR - Число
//		* ЦветПолос - Число
//		* ЦветТекста - Число
//		* ЦветФона - Число
//		* Ширина - Число
//		* Шрифт - Строка
//
Функция ПолучитьОбъектВнешнейКомпонентыГенерацияШтрихКода() Экспорт

	Возврат Спец_ОбщегоНазначенияКлиентСервер.ПодключитьВнешнююКомпонентуДляРаботы(
			"ОбщийМакет.Спец_КомпонентаПечатиШтрихкодов",
			"barcode",
			"barcode");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Коды - Соответствие из КлючИЗначение:
//		* Ключ - Строка - Код
//		* Значение - см. Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.НовоеОписаниеКода
//  Код - Строка
//  Имя - Строка
//  ФиксированнаяДлина - Число, Неопределено -
//  ПеременнаяДлина - Число, Неопределено -
//  ТипФиксированногоЗначения - Строка, Неопределено -
//  ТипПеременногоЗначения - Строка, Неопределено -
//  ТребуетсяРазделитель - Булево
//
Процедура ДобавитьКодGS1(Коды, Код, Имя, ФиксированнаяДлина = 0, ПеременнаяДлина = 0, ТипФиксированногоЗначения = Неопределено,
		ТипПеременногоЗначения = Неопределено, ТребуетсяРазделитель = Ложь)
	
	ПоследнийСимволКода = Прав(Код, 1);
	Если СтрНайти("0123456789", ПоследнийСимволКода) = 0 Тогда
		КодБезПоследнегоСимвола = Лев(Код, СтрДлина(Код) - 1);
		Если ПоследнийСимволКода = "n" Тогда
			Описание = Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.НовоеОписаниеКода(КодБезПоследнегоСимвола, Имя, ФиксированнаяДлина, ПеременнаяДлина, ТипФиксированногоЗначения, ТипПеременногоЗначения, ТребуетсяРазделитель);
			Описание.ЕстьПоложениеДесятичнойТочки = Истина;
			Коды.Вставить(КодБезПоследнегоСимвола, Описание);
		Иначе
			Для Индекс = 0 По 9 Цикл
				НовыйКод = КодБезПоследнегоСимвола + Строка(Индекс);
				Коды.Вставить(НовыйКод, Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.НовоеОписаниеКода(НовыйКод, Имя, ФиксированнаяДлина, ПеременнаяДлина, ТипФиксированногоЗначения, ТипПеременногоЗначения, ТребуетсяРазделитель));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Коды.Вставить(Код, Спец_ГенерацияЧтениеШтрихКодаКлиентСервер.НовоеОписаниеКода(Код, Имя, ФиксированнаяДлина, ПеременнаяДлина, ТипФиксированногоЗначения, ТипПеременногоЗначения, ТребуетсяРазделитель));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
