// @strict-types

#Область ОбработчикиСобытий

// Параметры:
//  ПараметрКоманды - Произвольный
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКоманды_ПослеУточнения", ЭтотОбъект);
	Спец_ОбщегоНазначенияКлиент.ПоказатьВопросДляДолгойОбработкиСБлокировкой(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Результат - КодВозвратаДиалога
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ОбработкаКоманды_ПослеУточнения(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Спец_ПолучитьКонстанту(ПредопределенноеЗначение("ПланВидовХарактеристик.Спец_Константы.ПервоначальноеЗаполнениеВыполнено"), Ложь) Тогда
		
		Спец_ОбщегоНазначенияКлиент.ВывестиСостояние("Первоначальное заполнение констант...", 1, , БиблиотекаКартинок.Спец_ДлительнаяОперация);
		Спец_ОбщегоНазначенияВызовСервера.УстановитьКонстантыПоУмолчанию();
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;
	
	СтруктураЗадания = Спец_РаботаСФоновымиЗаданиямиКлиентСервер.ПолучитьСтруктуруПараметровВыполненияФоновогоЗадания();
	
	СтруктураЗадания.ИмяРегламентногоЗадания = "Спец_ОбщегоНазначения.ОбновлениеКонфигурации";
	СтруктураЗадания.РаботаЧерезРегистр      = Истина;
	СтруктураЗадания.ТаймаутВыполнения       = Спец_КонстантыКлиентСервер.СекундВЧасе();
	СтруктураЗадания.ВывестиФорму            = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКоманды_ПослеВыполнения", ЭтотОбъект);
	Спец_РаботаСФоновымиЗаданиямиКлиентСервер.ЗапуститьВыполнениеФоновогоЗадания(СтруктураЗадания,
			Спец_КонстантыКлиентСервер.СекундВЧасе(),
			,
			ОписаниеОповещения,
			,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Параметры:
//  Результат - Булево
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ОбработкаКоманды_ПослеВыполнения(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Спец_ОбщегоНазначенияКлиент.СообщитьПользователю("Успешно");
	
КонецПроцедуры

#КонецОбласти
