// @strict-types

//@skip-check common-module-type

#Область СлужебныйПрограммныйИнтерфейс

// Соответствие версий моих компонент. Заполняется руками (чтобы при запуске не терять время на подключение каждой компоненты).
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//		* Ключ - Строка
//		* Значение - см. НоваяСтруктураВерсииМоейКомпоненты
//
Функция ПолучитьСоответствиеВерсийМоихКомпонент() Экспорт
	
	СоответствиеРезультат = Новый Соответствие();
	
	СоответствиеРезультат["ОбщийМакет.Спец_КомпонентаLykovExtFunctions"] = НоваяСтруктураВерсииМоейКомпоненты("1.0.0.18", "ПолучитьКомпонентуBaseFunction");
	СоответствиеРезультат["ОбщийМакет.Спец_КомпонентаLykovHTTPClient"]   = НоваяСтруктураВерсииМоейКомпоненты("1.0.0.19", "ПолучитьКомпонентуHTTPClient");
	СоответствиеРезультат["ОбщийМакет.Спец_КомпонентаLykovMySQL"]        = НоваяСтруктураВерсииМоейКомпоненты("1.0.0.18", "ПолучитьКомпонентуMySQL");
	СоответствиеРезультат["ОбщийМакет.Спец_КомпонентаLykovPostgreSQL"]   = НоваяСтруктураВерсииМоейКомпоненты("1.0.0.18", "ПолучитьКомпонентуPostgreSQL");
	
	Возврат Спец_РаботаСКоллекциямиКлиентСервер.СкопироватьСоответствие(СоответствиеРезультат, Истина);
	
КонецФункции

// Массив имён моих компонент.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из Строка - Массив имён моих компонент
//
Функция ПолучитьМассивИменМоихКомпонент() Экспорт
	
	МассивРезультат = Спец_РаботаСКоллекциямиКлиентСервер.ВыгрузитьМассивЗначений(
			Спец_КомпонентаДополнительныеФункцииКлиентСерверПовтИсп.ПолучитьСоответствиеВерсийМоихКомпонент(),
			"Ключ"); // Массив из Строка
	
	Возврат Новый ФиксированныйМассив(МассивРезультат);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Типизация

// Параметры:
//  НомерВерсии - Строка
//  НаименованиеФункцииДляПодключения - Строка
// 
// Возвращаемое значение:
//  Структура:
//		* НомерВерсии - Строка
//		* НаименованиеФункцииДляПодключения - Строка
//
Функция НоваяСтруктураВерсииМоейКомпоненты(Знач НомерВерсии, Знач НаименованиеФункцииДляПодключения)
	
	Возврат Новый Структура("НомерВерсии, НаименованиеФункцииДляПодключения",
			НомерВерсии, НаименованиеФункцииДляПодключения);
	
КонецФункции

#КонецОбласти

#КонецОбласти
