
#Область СлужебныйПрограммныйИнтерфейс

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

Функция ПолучитьСтруктуруПараметровДляПроверкиУОтправителя(Знач ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ПараметрыОбменовСДругимиБазами.База КАК База,
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник КАК ПолноеИмяОбъектаМетаданныхИсточник,
	|	ПараметрыОбменовСДругимиБазами.РегистрироватьСОбменомДанными КАК РегистрироватьСОбменомДанными,
	|	ПараметрыОбменовСДругимиБазами.ИмяРеквизитаДляПроверкиВКлючевыхОбъектах КАК ИмяРеквизитаДляПроверкиВКлючевыхОбъектах,
	|	ПараметрыОбменовСДругимиБазами.ТекстЗапросаИсключения_Отправитель КАК ТекстЗапросаИсключения_Отправитель
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	РегистрСведений.Спец_ПараметрыОбменовСДругимиБазами КАК ПараметрыОбменовСДругимиБазами
	|ГДЕ
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник = &ПолноеИмяОбъектаМетаданныхИсточник
	|	И ПараметрыОбменовСДругимиБазами.ОбменВключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.База КАК База,
	|	втРезультат.РегистрироватьСОбменомДанными КАК РегистрироватьСОбменомДанными,
	|	втРезультат.ИмяРеквизитаДляПроверкиВКлючевыхОбъектах КАК ИмяРеквизитаДляПроверкиВКлючевыхОбъектах,
	|	втРезультат.ТекстЗапросаИсключения_Отправитель КАК ТекстЗапросаИсключения_Отправитель
	|ИЗ
	|	втРезультат КАК втРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеОбъектовДляОбмена.База КАК База,
	|	СоответствиеОбъектовДляОбмена.ИмяТабличнойЧастиИсточник КАК ИмяТабличнойЧастиИсточник,
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаИсточник КАК ИмяРеквизитаИсточник
	|ИЗ
	|	РегистрСведений.Спец_СоответствиеОбъектовДляОбмена КАК СоответствиеОбъектовДляОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРезультат КАК втРезультат
	|		ПО СоответствиеОбъектовДляОбмена.База = втРезультат.База
	|		И СоответствиеОбъектовДляОбмена.ИмяОбъектаМетаданныхИсточник = втРезультат.ПолноеИмяОбъектаМетаданныхИсточник
	|ГДЕ
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаПриемник <> """"";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданныхИсточник", ПолноеИмяМетаданных);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	ВГраница       = ПакетыЗапросов.ВГраница();
	
	ТаблицаСоответствиеОбъектов = ПакетыЗапросов[ВГраница].Выгрузить();
	ТаблицаСоответствиеОбъектов.Индексы.Добавить("База, ИмяТабличнойЧастиИсточник, ИмяРеквизитаИсточник");
	
	ТаблицаРезультат = ПакетыЗапросов[ВГраница - 1].Выгрузить();
	
	Возврат Новый Структура("ТаблицаСоответствиеОбъектов, ТаблицаРезультат",
			ТаблицаСоответствиеОбъектов,
			ТаблицаРезультат);
	
КонецФункции

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульПолучателя

Функция ПолучитьМассивСтруктурДляПроверкиУПолучателя(Знач ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ОбъектыДляРегистрацииДляОбменов.База КАК База,
	|	ОбъектыДляРегистрацииДляОбменов.ПолноеИмяОбъектаМетаданных КАК ПолноеИмяОбъектаМетаданных,
	|	ОбъектыДляРегистрацииДляОбменов.ПоляДляИзменения КАК ПоляДляИзменения,
	|	ОбъектыДляРегистрацииДляОбменов.ТекстЗапросаИсключения КАК ТекстЗапросаИсключения
	|ИЗ
	|	РегистрСведений.Спец_ОбъектыДляРегистрацииДляОбменов КАК ОбъектыДляРегистрацииДляОбменов
	|ГДЕ
	|	ОбъектыДляРегистрацииДляОбменов.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяМетаданных);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	МассивРезультат = Спец_ОбщегоНазначения.ПреобразоватьТаблицуЗначенийВМассивСтрок(ТаблицаРезультат);
	Возврат Спец_РаботаСКоллекциямиКлиентСервер.СкопироватьМассив(МассивРезультат, Истина);
	
КонецФункции

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульПолучателя

#КонецОбласти
