// @strict-types

#Область ПрограммныйИнтерфейс

// Строка английского алфавита (в верхнем регистре)
// 
// Возвращаемое значение:
//  Строка
//
Функция АнглийскийАлфавит() Экспорт
	
	Возврат "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
КонецФункции

// Строка русского алфавита (в верхнем регистре)
// 
// Возвращаемое значение:
//  Строка
//
Функция РусскийАлфавит() Экспорт
	
	Возврат "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	
КонецФункции

// Строка, содержащая все цифры
// 
// Возвращаемое значение:
//  Строка
//
Функция ВсеЦифры() Экспорт
	
	Возврат "1234567890";
	
КонецФункции

// Длина идентификатора ссылки (UID)
// 
// Возвращаемое значение:
//  Число
//
Функция ДлинаИдентификатораСсылки() Экспорт
	
	Возврат 36;
	
КонецФункции

// Количество секунд в сутках
// 
// Параметры:
//  КоличествоСуток - Число
// 
// Возвращаемое значение:
//  Число
//
Функция СекундВСутках(Знач КоличествоСуток = 1) Экспорт
	
	Возврат КоличествоСуток * 86400;
	
КонецФункции

// Количество минут в сутках
// 
// Параметры:
//  КоличествоСуток - Число
//  
// Возвращаемое значение:
//  Число
//
Функция МинутВСутках(Знач КоличествоСуток = 1) Экспорт

	Возврат КоличествоСуток * 1440;

КонецФункции

// Количество байт в терабайте
// 
// Параметры:
//  КоличествоТБ - Число
//  
// Возвращаемое значение:
//  Число
//
Функция БайтВТерабайте(Знач КоличествоТБ = 1) Экспорт
	
	Возврат 1099511627776 * КоличествоТБ;
	
КонецФункции

// Количество байт в гигабайте
// 
// Параметры:
//  КоличествоГБ - Число
//  
// Возвращаемое значение:
//  Число
//
Функция БайтВГигабайте(Знач КоличествоГБ = 1) Экспорт
	
	Возврат 1073741824 * КоличествоГБ;
	
КонецФункции

// Количество байт в мегабайте
// 
// Параметры:
//  КоличествоМБ - Число
//  
// Возвращаемое значение:
//  Число
//
Функция БайтВМегабайте(Знач КоличествоМБ = 1) Экспорт
	
	Возврат 1048576 * КоличествоМБ;
	
КонецФункции

// Количество байт в килобайте
// 
// Параметры:
//  КоличествоКБ - Число
//  
// Возвращаемое значение:
//  Число
//
Функция БайтВКилобайте(Знач КоличествоКБ = 1) Экспорт
	
	Возврат 1024 * КоличествоКБ;
	
КонецФункции

// Возвращает наименование функции для получения текущего unix timestamp в PostrgeSQL
// 
// Возвращаемое значение:
//  Строка
//
Функция ТекущийUnixTimestampВPostrgeSQL() Экспорт
	
	Возврат "extract(epoch from clock_timestamp())";
	
КонецФункции

#КонецОбласти
