// @strict-types

//@skip-check method-too-many-params
//@skip-check common-module-type

#Область СлужебныйПрограммныйИнтерфейс

// Подключает внешнюю компоненту для генерации штрих-кодов
// 
// Возвращаемое значение:
//	ОбъектВнешнейКомпоненты - Компонента для генерации штрих-кодов:
//		* ECL - Число
//		* GS1DatabarКоличествоСтрок - Число
//		* АвтоТип - Булево
//		* Версия - Строка
//		* ВертикальноеВыравниваниеКода - Число
//		* ВертСмещение - Число
//		* ВидимостьКС - Булево
//		* ВыравниваниеКода - Число
//		* Высота - Число
//		* ГорСмещение - Число
//		* ГрафикаУстановлена - Булево
//		* ЗначениеКода - Строка
//		* ИмяФайла - Строка
//		* КоличествоСтолбцов - Число
//		* КоличествоСтрок - Число
//		* КоличествоШрифтов - Число
//		* КонтрольныйСимвол - Строка
//		* ЛоготипКартинка - Строка - Картинка в формате Base64 
//		* ЛоготипРазмерПроцентОтШК - Число
//		* МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения - Число
//		* МинимальнаяВысотаКода - Число
//		* МинимальнаяШиринаКода - Число
//		* ОриентацияТекста - Число
//		* ОтображатьТекст - Булево
//		* ПоложениеТекста - Число
//		* ПрозрачныйФон - Булево
//		* Пропорции - Строка
//		* РазделителиКода - Число
//		* РазмерКрая - Число
//		* РазмерШрифта - Число
//		* Результат - Число
//		* СодержитКС - Булево
//		* ТекстКода - Строка
//		* ТипВходныхДанных - Число
//		* ТипКода - Число
//		* УбратьЛишнийФон - Булево
//		* УголПоворота - Число
//		* УровеньКоррекцииQR - Число
//		* ЦветПолос - Число
//		* ЦветТекста - Число
//		* ЦветФона - Число
//		* Ширина - Число
//		* Шрифт - Строка
//
Функция ПолучитьОбъектВнешнейКомпонентыГенерацияШтрихКода() Экспорт

	Возврат Спец_ОбщегоНазначенияКлиентСервер.ПодключитьВнешнююКомпонентуДляРаботы(
			"ОбщийМакет.Спец_КомпонентаПечатиШтрихкодов",
			"barcode",
			"barcode");

КонецФункции

#КонецОбласти
